#+TITLE: lecture 4: dynamical systems
#+AUTHOR: james gilles
#+EMAIL: jhgilles@mit.edu
#+DATE: september 16 2019
#+OPTIONS: tex:t latex:t
#+STARTUP: latexpreview
https://mitmath.github.io/18337/lecture4/dynamical_systems

* efficiently implementing loops on a computer

#+BEGIN_SRC julia :session jl :async yes
function solve_system(f, u0, p, n)
    u = u0
    for i in 1:n-1
        u = f(u, p)
    end
    u
end
#+END_SRC

#+RESULTS:
: 8

for this to be efficient, julia needs to know about type of function
in julia, all functions have a unique type; this forces system to auto-specialization mechanism to always specialize higher-order function
(this is slightly inside baseball, could get this behavior other ways...)
can also force system to work with function pointers (FunctionReprs.jl); but make sure function pointer has sensible return types. also, cost of functionthis system should approach 0:

#+BEGIN_SRC julia :session jl :async yes
f(x, p) = x^2 -p*x
solve_system(f, 1., .25, 10)
#+END_SRC

#+RESULTS:
: 9.57602880527138e-6

-> approaches 0!

...

region w/ lipschitz derivative is $p + 1$:

#+BEGIN_SRC julia :session jl :async yes
solve_system(f, 1.251, .25, 100)
#+END_SRC

#+RESULTS:
: 3.8234317863564664

how does all of this perform?

pretty well! it's also generic.

you can also cache results as you go: TODO look up in notes

don't worry too much about cost of appending to array, grows by doubling; but can still pre-allocate for slightly better performance if u feel like it

save points as rows: sensible
save points as columns: better in memory

*important*: slices in julia allocate!!?!?! have to use `@view`
also, permutation copies by default as well, need to use PermutedDimsArray

pushing is more efficient than rebuilding matrix every time, dumbass
